{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 177. Тайна египетских пирамид"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Новый перспективный сервис Яндекс Пирамиды ищет стажера со знаниями в ML. В качестве тестового задания предлагается расшифровать найденную совсем недавно древнюю табличку, на которой записана формула, по предположению археологов, лежащая в основе архитектуры египетских пирамид. Возможно, происхождение этой таблички инопланетное!\n",
    "\n",
    "Известно, что на табличке запечатлена следующая надпись:\n",
    "\n",
    "$f(x) = a*tg(x)+(b*sin(x)+c*cos(x))^2+d*sqrt(x)$\n",
    "\n",
    "При этом часть таблички стерлась и значения коэффициентов $a,b,c,d$ утрачены. Тем не менее, на обратной стороне таблички были обнаружены некоторые известные значения $f(x)$ для построенных пирамид.\n",
    "\n",
    "У Вас есть прекрасная возможность помочь с решением данной головоломки, найдя неизвестные коэффициенты, и не только попасть на стажировку, но и поучаствовать в совершении прорыва в области археологии и уфологии.\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "В первой строке задается целое число $(10≤n≤1000)$ — количество известных значений функции $f(x)$. Далее следует $n$ строк, в каждой из которых записана пара действительных чисел $x$ и $f(x)$, разделенные пробелом.\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Выведите значения неизвестных коэффициентов $a,b,c,d$ в одной строке через пробел с точностью ровно 2 знака после запятой."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Решение"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "$f(x) = a*tg(x)+(b*sin(x)+c*cos(x))^2+d*sqrt(x)$\n",
    "\n",
    "Если раскрыть:\n",
    "\n",
    "$f(x) = a*tg(x)+b^2*sin(x)^2+2*b*c*sin(x)*cos(x) + c^2*cos(x)^2+d*sqrt(x)$\n",
    "\n",
    "Т.е.:\n",
    "\n",
    "$feature_1 = tg(x)$\n",
    "\n",
    "$feature_2 = sin(x)^2$\n",
    "\n",
    "$feature_3 = sin(x)*cos(x)$\n",
    "\n",
    "$feature_4 = cos(x)^2$\n",
    "\n",
    "$feature_5 = sqrt(x)$\n",
    "\n",
    "**После построения линейной регрессии получим следующий коэффиценты:**\n",
    "\n",
    "$c1 = a$\n",
    "\n",
    "$t2 = b^2$\n",
    "\n",
    "$t3 = 2*b*c$\n",
    "\n",
    "$t4 = c^2$\n",
    "\n",
    "$t5 = d$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from scipy.optimize import curve_fit\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "\n",
    "n = int(input())\n",
    "\n",
    "train = []\n",
    "for i in range(n):\n",
    "    train.append(list(map(float, input().split())))\n",
    "\n",
    "train = pd.DataFrame(train, columns=['x','y'])\n",
    "\n",
    "def func(x, a, b, c, d):\n",
    "    return a*np.tan(x) + (b*np.sin(x) + c*np.cos(x))**2 + d*np.sqrt(x)\n",
    "\n",
    "popt, pcov = curve_fit(func, train.x, train.y)\n",
    "\n",
    "for i in popt:\n",
    "    print(np.round(i,2))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
