{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 288. Оптимальная константа"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Бэкенд приложения Яндекс Go устроен по принципу микросервисной архитектуры. При таком устройстве модель машинного обучения может применяться в одном микросервисе (сервере) М1, а использоваться её предсказания будут в другом микросервисе М2, общение между которыми происходит по сети. Поэтому внутри микросервиса М2 необходимо обрабатывать ситуацию, когда по какой-то причине предсказания модели нет (например, для некоторого процента запросов сервис М1 не успевает ответить за заданное время). Основной способ обработать отсутствие предсказания — заменить его на дефолтное простое предсказание (оно будет храниться в конфиге в сервисе М2, значит всегда доступно).\n",
    "\n",
    "Например, сервис М1 может на основе текущей информации о числе пользователей и водителей в районе, текущего времени, погодных условий и т.д. предсказывать число заказов в ближайшие полчаса. Под капотом сервиса — градиентный бустинг, который учитывает всё множество численных и категориальных факторов. На большинство запросов сервиса М2 сервис М1 успевает отдать это точное предсказание. Но если не успел, достанем из конфига константу, рассчитанную по историческим данным за последний месяц. Константу можно рассчитать, оптимизируя разные метрики качества.\n",
    "\n",
    "Мы можем минимизировать среднеквадратичное отклонение MSE:\n",
    "\n",
    "$MSE = \\frac{1}{N}(y_i-C)^2$\n",
    "\n",
    "среднюю абсолютную ошибку MAE:\n",
    "\n",
    "$MAE = \\frac{1}{N}||y_i-C||$\n",
    "\n",
    "или cреднюю абсолютную процентную ошибку MAPE:\n",
    "\n",
    "$MAPE = \\frac{1}{N}||\\frac{y_i-C}{y_i}||$\n",
    "\n",
    "где, $y_i$ -  элемент выборки, а $C$ - искомое константное предсказание.\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "В первой строке ввода задано целое число $N (1≤N≤10^5 + 1)$ - размер выборки.\n",
    "\n",
    "Следующие $N$ строк содержат по одному целому числу $y_i (1≤y_i≤10^6)$ - $i$-му элементу выборки.\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Выведите три действительных числа, разделенных переводами строк:\n",
    "\n",
    "- Константу, минимизирующую MSE на входной выборке.\n",
    "- Константу, минимизирующую MAE на входной выборке.\n",
    "- Константу, минимизирующую MAPE на входной выборке.\n",
    "\n",
    "Константа будет считаться верной, если абсолютное или относительное отклонение соответствующей метрики от оптимальной не будет превышать $10^{-6}$.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###Пример 1\n",
    "\n",
    "**Ввод**<br>\n",
    "5<br>\n",
    "6<br>\n",
    "4<br>\n",
    "3<br>\n",
    "5<br>\n",
    "3<br>\n",
    "\n",
    "**Вывод**<br>\n",
    "4.2 <br>\n",
    "4<br>\n",
    "3<br>\n",
    "\n",
    "###Пример 2\n",
    "**Ввод**<br>\n",
    "4<br>\n",
    "10<br>\n",
    "100<br>\n",
    "10<br>\n",
    "100<br>\n",
    "\n",
    "**Вывод**<br>\n",
    "55<br>\n",
    "100<br>\n",
    "10<br>\n",
    "\n",
    "###Пример 3\n",
    "**Ввод**<br>\n",
    "5<br>\n",
    "10<br>\n",
    "1<br>\n",
    "3<br>\n",
    "4<br>\n",
    "2<br>\n",
    "\n",
    "**Вывод**<br>\n",
    "4<br>\n",
    "3<br>\n",
    "2<br>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np\n",
    "\n",
    "n = int(input())\n",
    "y = np.array([int(input()) for i in range(n)])\n",
    "\n",
    "c_mse = y.mean()\n",
    "\n",
    "y.sort()\n",
    "\n",
    "s = - sum(1/y)\n",
    "i = 0\n",
    "while s < 0:\n",
    "    s += 2/y[i]\n",
    "    c_mape = y[i]\n",
    "    i += 1\n",
    "\n",
    "c_mae = np.median(y)\n",
    "\n",
    "print(c_mse)\n",
    "print(c_mae)\n",
    "print(c_mape)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
